# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём.

names = ['Оля', 'Петя', 'Вася', 'Маша']

for name in names:
    x = len(name)
    print("{} - {} букв(ы)".format(name, x))